base/InformationRegisters/ПланыСчетовМеждународногоУчетаОрганизаций.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>ПланыСчетовМеждународногоУчетаОрганизаций</Name>
			<InformationRegisterPeriodicity>Month</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>НастройкаФормированияПроводок</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.НастройкиФормированияПроводокМеждународногоУчета</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ПланСчетов</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПланыСчетовМеждународногоУчета</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

base/InformationRegisters/ПланыСчетовМеждународногоУчетаОрганизаций/Ext/RecordSetModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)
	
	Если ТипЗнч(ДанныеЗаполнения) = Тип("Структура") Тогда
		Если ДанныеЗаполнения.Свойство("НастройкаФормированияПроводок") Тогда
			ДанныеЗаполнения.Вставить("ПланСчетов", 
				ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ДанныеЗаполнения.НастройкаФормированияПроводок, "Владелец"));
		КонецЕсли;
	Иначе
		ДанныеЗаполнения = Новый Структура();
	КонецЕсли;
	
	Если Не ДанныеЗаполнения.Свойство("ПланСчетов") Тогда
		ДанныеЗаполнения.Вставить("ПланСчетов", Справочники.ПланыСчетовМеждународногоУчета.ПланСчетовПоУмолчанию());
	КонецЕсли;

КонецПроцедуры

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	УправленческаяОрганизация = Справочники.Организации.УправленческаяОрганизация;
	
	Для Каждого ЗаписьРегистра Из ЭтотОбъект Цикл
		Если ЗаписьРегистра.Организация = УправленческаяОрганизация
			И НЕ ЗаписьРегистра.НастройкаФормированияПроводок.Пустая() Тогда
			ТекстСообщения = СтрШаблон(
				НСтр("ru = 'Для организации ""%1"" использование международного финансового учета не предусмотрено.';
					|en = 'Use of financial accounting is not provided for ""%1"" company.'"),
				УправленческаяОрганизация);
			ОбщегоНазначения.СообщитьПользователю(ТекстСообщения,, "Организация",, Отказ);
		КонецЕсли;
	КонецЦикла;
	
	Если Не МеждународныйУчетОбщегоНазначения.НастройкаПроводокПоОбъектамУчетаИлиРеглУчету() Тогда
		НастройкиФормированияПроводок = Выгрузить(, "НастройкаФормированияПроводок").ВыгрузитьКолонку("НастройкаФормированияПроводок");
		СпособыАннулированияПроводок = ОбщегоНазначения.ЗначениеРеквизитаОбъектов(НастройкиФормированияПроводок, "СпособАннулированияПроводок");
		
		Для Каждого КлючИЗначение Из СпособыАннулированияПроводок Цикл
			Если КлючИЗначение.Значение = Перечисления.СпособыАннулированияПроводокМеждународногоУчета.РеверсивнымиПроводками Тогда
				ТекстСообщения = НСтр("ru = 'Нельзя использовать настройку формирования проводок со способом корректировки реверсивными проводками';
										|en = 'Cannot use the posting schema with correction by reversing entries'");
				ОбщегоНазначения.СообщитьПользователю(ТекстСообщения,, "НастройкаФормированияПроводок",, Отказ);
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;

КонецПроцедуры

Процедура ПередЗаписью(Отказ, Замещение)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;

	ОбновлениеИнформационнойБазы.ПроверитьОбъектОбработан(ЭтотОбъект);

КонецПроцедуры

#КонецОбласти

#КонецЕсли
